frontend/views/site/index.php

use yii\widgets\ListView;

/* @var $this yii\web\View */
$siteconfig = \common\models\System::findOne(['id' => 1]);
---
SELECT * FROM `system` WHERE `id`=1